Revit 2027 API
ParameterTypeId.AnalyticalNodeCanBeHosted Property
 "Can Be Hosted": Specifies of the Analytical Node can be hosted or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalNodeCanBeHosted { get; }
Public Shared ReadOnly Property AnalyticalNodeCanBeHosted As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalNodeCanBeHosted {
	ForgeTypeId^ get ();
}
static member AnalyticalNodeCanBeHosted : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace